In [1]:
%load_ext sql

In [3]:
%sql mysql+pymysql://Admin:e39v/8,<WW0-@192.168.1.214/

'Connected: Admin@'

In [4]:
%%sql 
SHOW databases;

 * mysql+pymysql://Admin:***@192.168.1.214/
9 rows affected.

[('information_schema',),
 ('lab1',),
 ('lab2',),
 ('mydb',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('sys',),
 ('world',)]

In [24]:
%%sql
USE lab2;
-- drops all tables
SET FOREIGN_KEY_CHECKS = 0;
DROP TABLE IF EXISTS Users;
DROP TABLE IF EXISTS Theaters;
DROP TABLE IF EXISTS Movies;
DROP TABLE IF EXISTS MovieShows;
DROP TABLE IF EXISTS Tickets;
SET FOREIGN_KEY_CHECKS = 1;

-- create tables
CREATE TABLE Users (
    username varchar(255) NOT NULL,
    first_name varchar(255) NOT NULL,
    last_name varchar(255) NOT NULL,
    adress varchar(255),
    phone_number varchar(10) NOT NULL,
    PRIMARY KEY (username)
);

CREATE TABLE Theaters(
    theater_name varchar(255) NOT NULL,
    seats INT NOT NULL,
    PRIMARY KEY (theater_name)
);

CREATE TABLE Movies(
    movie_id INT NOT NULL AUTO_INCREMENT,
    movie_name varchar(255) NOT NULL,
    PRIMARY KEY (movie_id)
);

CREATE TABLE MovieShows(
    movie_show_id INT NOT NULL AUTO_INCREMENT,
    date DATE NOT NULL,
    available_seats INT NOT NULL,
    theater_name varchar(255) NOT NULL,
    movie_id INT NOT NULL,
    FOREIGN KEY (theater_name) REFERENCES Theaters(theater_name),
    FOREIGN KEY (movie_id) REFERENCES Movies(movie_id),
    PRIMARY KEY (movie_show_id)
);

CREATE TABLE Tickets(
    reservation_number INT NOT NULL AUTO_INCREMENT,
    username varchar(255) NOT NULL,
    movie_show_id INT NOT NULL,
    FOREIGN KEY (username) REFERENCES Users(username),
    FOREIGN KEY (movie_show_id) REFERENCES MovieShows(movie_show_id),
    PRIMARY KEY (reservation_number)
);

-- insert values
INSERT INTO Movies(movie_name) VALUES('King kong');
INSERT INTO Movies(movie_name) VALUES('Star Wars');
INSERT INTO Movies(movie_name) VALUES('Pretty Woman');
INSERT INTO Movies(movie_name) VALUES('Wayne''s World');
INSERT INTO Movies(movie_name) VALUES('Mighty Ducks');
INSERT INTO Movies(movie_name) VALUES('Godfather, The');
INSERT INTO Movies(movie_name) VALUES('Casablanca');
INSERT INTO Movies(movie_name) VALUES('Dr. Strangelove');
INSERT INTO Movies(movie_name) VALUES('Some Like It Hot');
INSERT INTO Movies(movie_name) VALUES('Apartment, The');
INSERT INTO Movies(movie_name) VALUES('Philadelphia Story, The');

INSERT INTO Users VALUES('Admin', 'one', 'two', null,'0724582945');

INSERT INTO Theaters VALUES('theater_01', 231);

INSERT INTO MovieShows VALUES('2020-03-21', 231, 'theater_01', 2);

-- user wants a ticket
-- if available_seats > 0 then
INSERT INTO Tickets(username, date, movie_id) VALUES('Admin', '2020-03-21', 2);

UPDATE MovieShows SET available_seats = available_seats - 1
WHERE date = '2020-03-21' AND movie_id = 2;
-- else return no seats left

 * mysql+pymysql://Admin:***@192.168.1.214/
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
0 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
0 rows affected.

[]

In [25]:
%%sql
select *
from users natural join tickets natural join movies natural join movieshows natural join theaters

 * mysql+pymysql://Admin:***@192.168.1.214/
1 rows affected.

[('theater_01', 2, datetime.date(2020, 3, 21), 'Admin', 'one', 'two', None, '0724582945', 1, 'Star Wars', 230, 231)]